<a href="https://colab.research.google.com/github/camrespicio/QuantiumPotatoChipAnalysis/blob/main/Quantium_Data_Virtual_Internship.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
from google.colab import drive
drive.mount('/content/gdrive')

Drive already mounted at /content/gdrive; to attempt to forcibly remount, call drive.mount("/content/gdrive", force_remount=True).

In [2]:
customer_behavior_raw_df = pd.read_csv('/content/gdrive/My Drive/Colab Datasets/QVI_purchase_behaviour.csv')
customer_behavior_raw_df.head()

   LYLTY_CARD_NBR               LIFESTAGE PREMIUM_CUSTOMER
0            1000   YOUNG SINGLES/COUPLES          Premium
1            1002   YOUNG SINGLES/COUPLES       Mainstream
2            1003          YOUNG FAMILIES           Budget
3            1004   OLDER SINGLES/COUPLES       Mainstream
4            1005  MIDAGE SINGLES/COUPLES       Mainstream

In [3]:
transactions_raw_df = pd.read_csv('/content/gdrive/My Drive/Colab Datasets/QVI_transaction_data.csv')
transactions_raw_df.head()

    DATE  STORE_NBR  ...  PROD_QTY  TOT_SALES
0  43390          1  ...         2        6.0
1  43599          1  ...         3        6.3
2  43605          1  ...         2        2.9
3  43329          2  ...         5       15.0
4  43330          2  ...         3       13.8

[5 rows x 8 columns]

In [4]:
customer_behavior_raw_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 72637 entries, 0 to 72636
Data columns (total 3 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   LYLTY_CARD_NBR    72637 non-null  int64
 1   LIFESTAGE         72637 non-null  object
 2   PREMIUM_CUSTOMER  72637 non-null  object
dtypes: int64(1), object(2)
memory usage: 1.7+ MB

In [5]:
transactions_raw_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 264836 entries, 0 to 264835
Data columns (total 8 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   DATE            264836 non-null  int64
 1   STORE_NBR       264836 non-null  int64
 2   LYLTY_CARD_NBR  264836 non-null  int64
 3   TXN_ID          264836 non-null  int64
 4   PROD_NBR        264836 non-null  int64
 5   PROD_NAME       264836 non-null  object
 6   PROD_QTY        264836 non-null  int64
 7   TOT_SALES       264836 non-null  float64
dtypes: float64(1), int64(6), object(1)
memory usage: 16.2+ MB

In [6]:
merged_all_df = pd.merge(transactions_raw_df, customer_behavior_raw_df, how='left', on=['LYLTY_CARD_NBR'])
merged_all_df.head()

    DATE  STORE_NBR  ...               LIFESTAGE  PREMIUM_CUSTOMER
0  43390          1  ...   YOUNG SINGLES/COUPLES           Premium
1  43599          1  ...  MIDAGE SINGLES/COUPLES            Budget
2  43605          1  ...  MIDAGE SINGLES/COUPLES            Budget
3  43329          2  ...  MIDAGE SINGLES/COUPLES            Budget
4  43330          2  ...  MIDAGE SINGLES/COUPLES            Budget

[5 rows x 10 columns]

In [7]:
merged_all_df.dropna()
merged_all_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 264836 entries, 0 to 264835
Data columns (total 10 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   DATE              264836 non-null  int64
 1   STORE_NBR         264836 non-null  int64
 2   LYLTY_CARD_NBR    264836 non-null  int64
 3   TXN_ID            264836 non-null  int64
 4   PROD_NBR          264836 non-null  int64
 5   PROD_NAME         264836 non-null  object
 6   PROD_QTY          264836 non-null  int64
 7   TOT_SALES         264836 non-null  float64
 8   LIFESTAGE         264836 non-null  object
 9   PREMIUM_CUSTOMER  264836 non-null  object
dtypes: float64(1), int64(6), object(3)
memory usage: 22.2+ MB

In [8]:
df_new = merged_all_df.groupby(['LIFESTAGE', 'PREMIUM_CUSTOMER', 'PROD_NAME'])['TOT_SALES'].sum().reset_index()
df_new.sort_values(by=['TOT_SALES'])
df_new.head()

                LIFESTAGE  ... TOT_SALES
0  MIDAGE SINGLES/COUPLES  ...     193.2
1  MIDAGE SINGLES/COUPLES  ...     157.5
2  MIDAGE SINGLES/COUPLES  ...     111.3
3  MIDAGE SINGLES/COUPLES  ...     161.7
4  MIDAGE SINGLES/COUPLES  ...     158.4

[5 rows x 4 columns]

In [9]:
df_new.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2394 entries, 0 to 2393
Data columns (total 4 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   LIFESTAGE         2394 non-null   object
 1   PREMIUM_CUSTOMER  2394 non-null   object
 2   PROD_NAME         2394 non-null   object
 3   TOT_SALES         2394 non-null   float64
dtypes: float64(1), object(3)
memory usage: 74.9+ KB

In [10]:
print('There are {} unique lifestages.'.format(df_new['LIFESTAGE'].nunique()))
print('There are {} unique price markets.'.format(df_new['PREMIUM_CUSTOMER'].nunique()))
print('There are {} unique product names.'.format(df_new['PROD_NAME'].nunique()))

There are 7 unique lifestages.
There are 3 unique price markets.
There are 114 unique product names.

In [11]:
lifestage_ptable = pd.pivot_table(df_new, values = ['TOT_SALES'], index = ['LIFESTAGE'], aggfunc = {'TOT_SALES':np.mean})
lifestage_ptable2 = lifestage_ptable.sort_values(by = 'TOT_SALES', ascending=False)
lifestage_ptable2

                          TOT_SALES
LIFESTAGE
OLDER SINGLES/COUPLES   1176.686404
RETIREES                1071.552339
OLDER FAMILIES          1034.407018
YOUNG FAMILIES           924.444737
YOUNG SINGLES/COUPLES    761.419006
MIDAGE SINGLES/COUPLES   540.208480
NEW FAMILIES             147.466228

In [12]:
customer_ptable = pd.pivot_table(df_new, values = ['TOT_SALES'], index = ['PREMIUM_CUSTOMER'], aggfunc = {'TOT_SALES':np.mean})
customer_ptable2 = customer_ptable.sort_values(by = 'TOT_SALES', ascending=False)
customer_ptable2

                   TOT_SALES
PREMIUM_CUSTOMER
Mainstream        940.782581
Budget            847.382895
Premium           635.913471

In [13]:
prod_name_ptable = pd.pivot_table(df_new, values = ['TOT_SALES'], index = ['PROD_NAME'], aggfunc = {'TOT_SALES':np.mean})
prod_name_ptable2 = prod_name_ptable.sort_values(by = 'TOT_SALES', ascending=False)
prod_name_ptable2

                                            TOT_SALES
PROD_NAME
Dorito Corn Chp     Supreme 380g          1921.523810
Smiths Crnkle Chip  Orgnl Big Bag 380g    1731.790476
Smiths Crinkle Chips Salt & Vinegar 330g  1657.342857
Kettle Mozzarella   Basil & Pesto 175g    1640.828571
Smiths Crinkle      Original 330g         1633.457143
...                                               ...
WW Crinkle Cut      Chicken 175g           223.914286
Sunbites Whlegrn    Crisps Frch/Onin 90g   219.057143
WW Crinkle Cut      Original 175g          215.819048
Woolworths Mild     Salsa 300g             201.642857
Woolworths Medium   Salsa 300g             192.857143

[114 rows x 1 columns]